class Code:
    OK = 100200  # 成功
    创建成功 = 100201
    CLIENT_ERROR = 100400
    CLIENT_UNAUTHORIZED = 100401
    用户或密码错误 = 100402
    用户不存在 = 100403
    用户已存在 = 100404
    名字过长 = 100405
    手机号格式不正确 = 100406
    手机号位数不正确 = 100407
    不存在或无权查询 = 100408
    日期格式不正确 = 100409
    日期不能为空 = 100410
    时分错误 = 1004011
    房间不存在 = 100412
    房间已存在 = 100413
    房间名字不能为空 = 100414
    预订不存在 = 100415
    预订冲突 = 100416
    预订失败 = 100417
    json格式不正确 = 100418
    数据类型不正确 = 100419
    Content_Type_Error = 100420
    无权查询用户 = 100421
    无权创建用户 = 100422
    无权编辑用户 = 100423
    无权删除用户 = 100424

    无权查询房间 = 100425
    无权创建房间 = 100426
    无权编辑房间 = 100427
    无权删除房间 = 100428

    无权查询预订 = 100429
    无权创建预订 = 100430
    无权编辑预订 = 100431
    无权删除预订 = 100432


    _messages = {
        OK: "success",  # 成功
        创建成功: "创建成功",
        CLIENT_ERROR: "Your request is not valid.",
        CLIENT_UNAUTHORIZED: "Not authorized",
        用户或密码错误: "用户或密码错误",
        用户不存在: "用户不存在",
        用户已存在: "用户已存在",
        名字过长: "名字过长",
        手机号格式不正确: "手机号格式不正确",
        手机号位数不正确: "手机号位数不正确",
        不存在或无权查询: "不存在或无权查询",
        日期格式不正确: "日期格式不正确",
        日期不能为空: "日期不能为空",
        时分错误: "时分错误",
        房间不存在: "房间不存在",
        房间已存在: "房间已存在",
        预订不存在: "预订不存在",
        预订冲突: "预订冲突",
        预订失败: "预订失败",
        json格式不正确: "json格式不正确",
        数据类型不正确: "数据类型不正确",
        Content_Type_Error: "ContentTypeError",
        房间名字不能为空: "房间名字不能为空",
        无权查询用户: "无权查询用户",
        无权创建用户: "无权创建用户",
        无权编辑用户: "无权编辑用户",
        无权删除用户: "无权删除用户",
        无权查询房间: "无权查询房间",
        无权创建房间: "无权创建房间",
        无权编辑房间: "无权编辑房间",
        无权删除房间: "无权删除房间",
        无权查询预订: "无权查询预订",
        无权创建预订: "无权创建预订",
        无权编辑预订: "无权编辑预订",
        无权删除预订: "无权删除预订",
    }

    @classmethod
    def message(cls, code):
        return cls._messages.get(code)
